In [1]:
import pandas as pd

In [4]:
tech = [["Spark",2000,"30days"],
        ["pandas",3000,"40days"],
       ]

df = pd.DataFrame(tech)

df

        0     1       2
0   Spark  2000  30days
1  pandas  3000  40days

In [5]:
colname = ["Course","Fee","Duration"]

rowlabel = ["a","b"]

df= pd.DataFrame(tech,columns=colname,index=rowlabel)

In [6]:
df

   Course   Fee Duration
a   Spark  2000   30days
b  pandas  3000   40days

In [14]:
df.dtypes

Course      object
Fee          int64
Duration    object
dtype: object

In [16]:
# set custom types to DataFrame
types = {'Course':str,'Fee':float,'Duration':str}

df = df.astype(types)

df

   Course     Fee Duration
a   Spark  2000.0   30days
b  pandas  3000.0   40days

In [17]:
df.dtypes

Course       object
Fee         float64
Duration     object
dtype: object

In [18]:
# Create DataFrame from Dictionary
technologies = {
    'Courses':["Spark","PySpark","Hadoop"],
    'Fee' :[20000,25000,26000],
    'Duration':['30day','40days','35days'],
    'Discount':[1000,2300,1500]
              }

df2 = pd.DataFrame(technologies)

df2

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1500

In [20]:
# Create DataFrame with None/Null to work with examples
import pandas as pd
import numpy as np
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas",None,"Spark","Python"],
    'Fee' :[22000,25000,23000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
          })
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies, index=row_labels)

df

    Courses      Fee Duration  Discount
r0    Spark  22000.0    30day      1000
r1  PySpark  25000.0   50days      2300
r2   Hadoop  23000.0   55days      1000
r3   Python  24000.0   40days      1200
r4   Pandas      NaN   60days      2500
r5     None  25000.0    35day      1300
r6    Spark  25000.0               1400
r7   Python  22000.0   50days      1600

In [21]:
df.shape

(8, 4)

In [22]:
# Returns number of cells. It would be rows * columns.
df.size

32

In [23]:
df.columns

Index(['Courses', 'Fee', 'Duration', 'Discount'], dtype='object')

In [24]:
# Returns column names from the header as a list in pandas.
a = df.columns.values

a

array(['Courses', 'Fee', 'Duration', 'Discount'], dtype=object)

In [25]:
df.index

Index(['r0', 'r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7'], dtype='object')

In [26]:
df.index.values

array(['r0', 'r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7'], dtype=object)

In [27]:
# Pandas Select Columns by Name.
df['Fee']

r0    22000.0
r1    25000.0
r2    23000.0
r3    24000.0
r4        NaN
r5    25000.0
r6    25000.0
r7    22000.0
Name: Fee, dtype: float64

In [28]:
#  select multiple columns
df[['Fee','Duration']]

        Fee Duration
r0  22000.0    30day
r1  25000.0   50days
r2  23000.0   55days
r3  24000.0   40days
r4      NaN   60days
r5  25000.0    35day
r6  25000.0
r7  22000.0   50days

In [ ]:
# Filter DataFrame